In [5]:
import pandas as pd
import numpy as np

In [6]:
df = pd.DataFrame(
    np.random.choice(100, (3, 4)), 
    columns=list('ABCD')
)

In [7]:
df

    A   B   C   D
0  38  41  91  97
1  88  34  42  12
2  70  92  85  56

In [14]:
df.loc[0,'A']=100
#Como este método regresa una view, estamos operando sobre el mismo dataframe
#Pandas tiene paz

In [15]:
df

     A   B   C   D
0  100  41  91  97
1   88  34  42  12
2   70  92  85  56

In [18]:
df.loc[df['A'] > 70, 'B']
#Muestra los renglones donde A sea superior a 70
#de la columna B

0    41
1    34
Name: B, dtype: int32

In [25]:
df.loc[df['A'] > 70, ['B','C']]

   B   C
0  7  91
1  7  42

In [19]:
df.loc[df['A'] > 70, 'B']=7
#Podemos cambiar estos renglones

In [20]:
df

     A   B   C   D
0  100   7  91  97
1   88   7  42  12
2   70  92  85  56

In [26]:
 df[df.A == 70]['B'] = 100
#Este método regresa una copia
#Si cambiamos algo aquí, no operamos sobre el 
#frame original

C:\Users\carlos.munoz\AppData\Local\Temp\ipykernel_21352\1970436816.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[df.A == 70]['B'] = 100

In [27]:
df

     A   B   C   D
0  100   7  91  97
1   88   7  42  12
2   70  92  85  56

In [28]:
#Mejor usamos
df.loc[df['A']==70,'B']=100

In [29]:
df
#Como aquí operamos en una view, no hay problema

     A    B   C   D
0  100    7  91  97
1   88    7  42  12
2   70  100  85  56

In [31]:
#Podemos incluso usar máscaras booleanas sobre los renglones,
# en vez de las columnas
df.loc[0,df.iloc[1]<50]=50

In [32]:
df

     A    B   C   D
0  100   50  50  50
1   88    7  42  12
2   70  100  85  56